<a href="https://colab.research.google.com/github/GuilhermeDumam/Desafio_Estagio_Solvimm/blob/Master/Jos%C3%A9_Guilherme_Desafio_Est%C3%A1gio_em_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importamos a biblioteca pandas e a chamaremos no notebook de 'pd'
import pandas as pd

In [ ]:
#criamos um data frame com os dados do movies.csv, utilizaremos o separador ponto vírgula e colocamos duas colunas
df_movies = pd.read_csv('/content/movies.csv', sep = ';', names =['Movie_Id', 'movie'])

In [ ]:
#Questão 1.1 - Temos 4499 filmes no dataset. 
#Aqui a gente utiliza o método 'shape' para nos dizer a quantidade de linhas e colunas presente no data frame
df_movies.shape

(4499, 2)

In [ ]:
#Utilizamos a função '.head' para imprimir as cinco primeiras linhas com todas as colunas
df_movies.head(5)

   Movie_Id                                 movie
0         1               (Dinosaur Planet, 2003)
1         2    (Isle of Man TT 2004 Review, 2004)
2         3                     (Character, 1997)
3         4  (Paula Abdul's Get Up & Dance, 1994)
4         5      (The Rise and Fall of ECW, 2004)

In [ ]:
#A função '.tail' mostra as últimas cinco linhas do data frame
df_movies.tail(5)

      Movie_Id                                              movie
4494      4495  (Clifford: Happy Birthday Clifford / Puppy Lov...
4495      4496                      (Farewell My Concubine, 1993)
4496      4497                                 (Texasville, 1990)
4497      4498                                      (Gonin, 2000)
4498      4499                                 (In My Skin, 2002)

In [ ]:
#Método '.columns' nos mostra quais e os nomes das colunas presentes no dataframe, além de seu tipo
df_movies.columns

Index(['Movie_Id', 'movie'], dtype='object')

In [ ]:
#Chamamos a função 'info()' com o objetivo de nos mostrar informações sobre o dataframe, como quantidades de valores nulos, tipo dos dados, colunas, tamanho de uso da memória 
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4499 entries, 0 to 4498
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Movie_Id  4499 non-null   int64
 1   movie     4499 non-null   object
dtypes: int64(1), object(1)
memory usage: 70.4+ KB

In [ ]:
#Aqui criamos a coluna 'Ano' aplicando uma função oculta que fez com a partir da vírgula na coluna 'movie' fosse feito uma quebra de string para lista pela função '.split'
#e essa lista fosse colocada na coluna 'Ano' que foi criada. Percebe-se que a quebra se fez após a vírgula no segundo índice '[1]'
df_movies['Ano'] = df_movies['movie'].apply(lambda x: x.split(',')[1].strip().replace(')',''))

In [ ]:
#Chamamos a função '.head' de novo para nos mostrar como está o dataframe depois que adicionamos a coluna 'Ano' a ele.
df_movies.head()

   Movie_Id  ...                    Nome_Filme
0         1  ...               Dinosaur Planet
1         2  ...    Isle of Man TT 2004 Review
2         3  ...                     Character
3         4  ...  Paula Abdul's Get Up & Dance
4         5  ...      The Rise and Fall of ECW

[5 rows x 4 columns]

In [ ]:
#Criação da coluna 'Nome_Filme' a partir da quebra da string da coluna 'movie' e a troca do parenteses e da vírgula por espaço em branco.
df_movies['Nome_Filme'] = df_movies['movie'].apply(lambda x: x.split(',')[0].replace('(',''))

In [ ]:
#Aqui criamos um outro dataframe para podermos manipula-lo sem alterar o conteúdo original. Descartamos a coluna 'movie' do dataframe original.
df_movies_filter = df_movies.drop(columns='movie')

In [ ]:
#Usamos o '.head' para checarmos como está o dataframe original com as novas colunas.
df_movies.head()

   Movie_Id  ...                    Nome_Filme
0         1  ...               Dinosaur Planet
1         2  ...    Isle of Man TT 2004 Review
2         3  ...                     Character
3         4  ...  Paula Abdul's Get Up & Dance
4         5  ...      The Rise and Fall of ECW

[5 rows x 4 columns]

In [ ]:
#usamos a função .duplicated para retornar um valor verdadeiro se houver alguma linha duplicada. No caso abaixo, nenhum valor é duplicado.
df_movies[df_movies.duplicated()]

Empty DataFrame
Columns: [Movie_Id, movie, Ano, Nome_Filme]
Index: []

In [ ]:
#.head para imprimir as cinco primeiras linhas do novo dataframe. 
df_movies_filter.head()

   Movie_Id   Ano                    Nome_Filme
0         1  2003               Dinosaur Planet
1         2  2004    Isle of Man TT 2004 Review
2         3  1997                     Character
3         4  1994  Paula Abdul's Get Up & Dance
4         5  2004      The Rise and Fall of ECW

In [ ]:
##Questão 1.3
#Aqui colocamos a coluna 'Movie_Id' como coluna indexadora, após isso, dropamos ela para podermos ficar com apenas a coluna de ano e nome de filme.
#O inplace = true faz com que a coluna seja excluída, por default seria false, o que faria com que uma cópia fosse criada e armazenada na memória.
df_movies_filter.index = df_movies_filter['Movie_Id']
df_movies_filter.drop(columns='Movie_Id', inplace = True)

In [ ]:
#Aqui podemos ver que temos apenas 2 tabelas.
df_movies_filter.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4499 entries, 1 to 4499
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Ano         4499 non-null   object
 1   Nome_Filme  4499 non-null   object
dtypes: object(2)
memory usage: 105.4+ KB

In [ ]:
#Questão 1.3 - Os cinco anos que menos lançaram filme estão listados abaixo.
#Agrupamos por ano, colocamos para contar a quantidade de itens na coluna 'Nome_Filme' em ordem crescente, os cinco primeiros itens. 
df_movies_filter.groupby(by='Ano')['Nome_Filme'].count().sort_values(ascending = True).head(5)
#Houve anos que teve o mesmo número de lançamento (1916,1918,1924,1929,1931)

Ano
1915    1
1917    1
1922    1
1926    1
1916    2
Name: Nome_Filme, dtype: int64

In [ ]:
##Para respondermos as demais questões, vamos precisar importar o dataset 'customers_rating.csv' 
df_customers_rating = pd.read_csv('/content/customers_rating.csv', sep =';')

In [ ]:
#Quantas linhas e quantas colunas temos no dataframe. 
df_customers_rating.shape

(24053764, 4)

In [ ]:
df_customers_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24053764 entries, 0 to 24053763
Data columns (total 4 columns):
 #   Column    Dtype
---  ------    -----
 0   Cust_Id   int64
 1   Rating    float64
 2   Date      object
 3   Movie_Id  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 734.1+ MB

In [ ]:
df_customers_rating.head()

   Cust_Id  Rating        Date  Movie_Id
0  1488844     3.0  2005-09-06         1
1   822109     5.0  2005-05-13         1
2   885013     4.0  2005-10-19         1
3    30878     4.0  2005-12-26         1
4   823519     3.0  2004-05-03         1

In [ ]:
df_customers_rating[df_customers_rating.duplicated()]

Empty DataFrame
Columns: [Cust_Id, Rating, Date, Movie_Id]
Index: []

In [ ]:
#Para podermos analisar as informações de avaliações dos filmes, precisamos juntar as tabelas de avaliação e filmes para podermos fazer as análises necessárias
#Aqui criamos um novo dataframe contendo a junção das tabelas de customers e movies, usando a coluna 'movie id' como chave de join.
df_total = df_customers_rating.join(df_movies_filter, on = 'Movie_Id', how = 'inner')

In [ ]:
df_total.head()

   Cust_Id  Rating        Date  Movie_Id   Ano       Nome_Filme
0  1488844     3.0  2005-09-06         1  2003  Dinosaur Planet
1   822109     5.0  2005-05-13         1  2003  Dinosaur Planet
2   885013     4.0  2005-10-19         1  2003  Dinosaur Planet
3    30878     4.0  2005-12-26         1  2003  Dinosaur Planet
4   823519     3.0  2004-05-03         1  2003  Dinosaur Planet

In [ ]:
#Questão 1.2 - Os cinco melhores filmes em média de avaliação estão listados abaixo.
#Usamos da mesma lógica para responder a 1.3; usamos a coluna 'Nome_Filme' como coluna de filtro, e colocamos a média das avaliações
#em ordem decrescente, imprimos os 5 primeiros valores para obtermos a resposta da pergunta.
df_total.groupby(by='Nome_Filme')['Rating'].mean().sort_values(ascending=False).head(5)

Nome_Filme
Lost: Season 1                                                                 4.670989
Ghost in the Shell: Stand Alone Complex: 2nd Gig                               4.586364
The Simpsons: Season 6                                                         4.581296
Inu-Yasha                                                                      4.554434
Lord of the Rings: The Return of the King: Extended Edition: Bonus Material    4.552000
Name: Rating, dtype: float64

In [ ]:
#Questão 1.4

In [ ]:
#Transformamos a coluna 'Date' em uma coluna do tipo 'DATETIME' para podermos manipular as datas.
df_total['Date']= pd.to_datetime(df_total['Date'])

In [ ]:
#Percebe-se que a coluna 'Date' agora é uma coluna do tipo 'datetime'
df_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24053764 entries, 0 to 24053763
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   Cust_Id     int64
 1   Rating      float64
 2   Date        datetime64[ns]
 3   Movie_Id    int64
 4   Ano         object
 5   Nome_Filme  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 1.3+ GB

In [ ]:
#Aqui criamos uma lista que recebe os máximos valores únicos de data dentro do dataframe total
avaliacao_ultima_data = df_total[df_total['Date'] == df_total['Date'].unique().max()]

In [ ]:
#criamos uma lista que recebe os valores médios das avaliações agrupadas pelo 'nome_filme' em ordem crescente; usamos o 'reset_index()' para criarmos uma coluna
#de index que comece do 0 e vá até o total de linhas.
media_avaliacao = avaliacao_ultima_data.groupby(by='Nome_Filme')['Rating'].mean().sort_values(ascending=True).reset_index()

In [ ]:
print(media_avaliacao)

                                             Nome_Filme  Rating
0                                              The Muse     1.0
1     Commanding Heights: The Battle for the World E...     1.0
2                  Midsomer Murders: Ring Out Your Dead     1.0
3                                   Grand Theft Parsons     1.0
4                                           Convict 762     1.0
...                                                 ...     ...
1571                                     Mansfield Park     5.0
1572                                        Hard Boiled     5.0
1573  The Outer Limits: The New Series: Aliens Among Us     5.0
1574                             The Poseidon Adventure     5.0
1575                                   The Great Gatsby     5.0

[1576 rows x 2 columns]

In [ ]:
#Questão 1.4 - abaixo se encontra a quantidade de filmes com média de avaliação acima de 4.7 apenas no último ano de avaliação do dataset.
#Chamamos dentro da lista de média de avaliação onde os 'Ratings' que são maiores ou iguais a 4.7. Colocamos 'Nome_Filme'.count() para contar em referência da coluna.
media_avaliacao[media_avaliacao['Rating'] >= 4.7]['Nome_Filme'].count()

192

In [ ]:
#Questão 1.5
#Aqui nós agrupamos pelo 'Nome_Filme' a média em ordem crescente dos 10 primeiros filmes com a menor nota.
avaliacao_ultima_data.groupby(by='Nome_Filme')['Rating'].mean().sort_values(ascending = True).head(10)

Nome_Filme
The Muse                                                1.0
Commanding Heights: The Battle for the World Economy    1.0
Midsomer Murders: Ring Out Your Dead                    1.0
Grand Theft Parsons                                     1.0
Convict 762                                             1.0
Cop and a Half                                          1.0
I Love Lucy: Season 2                                   1.0
Angel Sanctuary                                         1.0
The Closet                                              1.0
Slam                                                    1.0
Name: Rating, dtype: float64

In [ ]:
#Questão 1.6 - O ID dos  5 cliente que mais avaliariam e a quantidade de avaliações que ele fez está abaixo.
#Aqui nós agrupamos pelo Id do cliente, as cinco primeiras avaliações em ordem decrescente.
df_total.groupby(by='Cust_Id')['Rating'].count().sort_values(ascending=False).head(5)

Cust_Id
305344     4467
387418     4422
2439493    4195
1664010    4019
2118461    3769
Name: Rating, dtype: int64

In [ ]:
#Muito Obrigado!